sequential/InterFoam/Hydraulic_jump_joao/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0) // 0
    (15 0 0) // 1
    (0 0.2535 0) // 2
    (15 0.2535 0) // 3
    (0 0.3 0) // 4
    (15 0.3 0) // 5
    (0 2.5 0) // 6
    (15 2.5 0) // 7
    (0 0 1.0) // 8
    (15 0 1.0) // 9
    (0 0.2535 1.0) // 10
    (15 0.2535 1.0) // 11
    (0 0.3 1.0) // 12
    (15 0.3 1.0) // 13
    (0 2.5 1.0) // 14
    (15 2.5 1.0) // 15
);

blocks
(
    hex (0 1 3 2 8 9 11 10) (300 5 20) simpleGrading (1 1 1)
    hex (2 3 5 4 10 11 13 12) (300 1 20) simpleGrading (1 1 1)
    hex (4 5 7 6 12 13 15 14) (300 44 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (8 0 2 10)
	    (10 2 4 12)
        );
    }

    leftWall
    {
        type wall;
        faces
        (
            (12 4 6 14)
        );
    }

    rightWall
    {
	type wall;
	faces
	(
	    (5 13 15 7)
	    (3 11 13 5)
	);
    }

    outlet
    {
        type patch;
	faces
	(
	    (1 9 11 3)
	);
    }

    lowerWall
    {
        type wall;
        faces
        (
            (0 1 9 8)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (6 7 15 14)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
